
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 4 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsights
  * azurerm_key_vault_secret.app_insights_connection_string
* Update
  * azurerm_resource_group.rg
  * module.key_vault.azurerm_key_vault.kv
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.key_vault.azurerm_user_assigned_identity.managed_identity[0]
* Delete
  * azurerm_application_insights.em_appinsights
  * azurerm_key_vault_secret.em_app_insights_connection_string
  * azurerm_key_vault_secret.em_app_insights_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "rpa-aat"
      + resource_group_name                   = "rpa-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_application_insights.em_appinsights will be destroyed
  # (because azurerm_application_insights.em_appinsights is not in configuration)
  - resource "azurerm_application_insights" "em_appinsights" {
      - app_id                                = "c69b4bcc-c4ab-44f9-965e-2125919d5164" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value)
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.Insights/components/em-aat" -> null
      - instrumentation_key                   = (sensitive value)
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "em-aat" -> null
      - resource_group_name                   = "rpa-aat" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#em-dev-chat"
          - "application"         = "evidence-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/em-shared-infrastructure.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#em-dev-chat"
          - "environment"         = "staging"
          - "managedBy"           = "Evidence Management"
        } -> null
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.em_app_insights_connection_string will be destroyed
  # (because azurerm_key_vault_secret.em_app_insights_connection_string is not in configuration)
  - resource "azurerm_key_vault_secret" "em_app_insights_connection_string" {
      - content_type            = "" -> null
      - id                      = "https://rpa-aat.vault.azure.net/secrets/em-app-insights-connection-string/718a8170467e4b658fe05438ff1c9451" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat" -> null
      - name                    = "em-app-insights-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat/secrets/em-app-insights-connection-string/versions/718a8170467e4b658fe05438ff1c9451" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat/secrets/em-app-insights-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "718a8170467e4b658fe05438ff1c9451" -> null
      - versionless_id          = "https://rpa-aat.vault.azure.net/secrets/em-app-insights-connection-string" -> null
    }

  # azurerm_key_vault_secret.em_app_insights_key will be destroyed
  # (because azurerm_key_vault_secret.em_app_insights_key is not in configuration)
  - resource "azurerm_key_vault_secret" "em_app_insights_key" {
      - content_type            = "" -> null
      - id                      = "https://rpa-aat.vault.azure.net/secrets/EmAppInsightsInstrumentationKey/37823dd3e82b4bc1aa19ef09932facdc" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat" -> null
      - name                    = "EmAppInsightsInstrumentationKey" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat/secrets/EmAppInsightsInstrumentationKey/versions/37823dd3e82b4bc1aa19ef09932facdc" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat/secrets/EmAppInsightsInstrumentationKey" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "37823dd3e82b4bc1aa19ef09932facdc" -> null
      - versionless_id          = "https://rpa-aat.vault.azure.net/secrets/EmAppInsightsInstrumentationKey" -> null
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat"
        name     = "rpa-aat"
      ~ tags     = {
          - "Destroy Me"          = "No" -> null
          - "Team Contact"        = "#em-dev-chat" -> null
          ~ "application"         = "evidence-management" -> "professional-applications"
          ~ "contactSlackChannel" = "#em-dev-chat" -> "#rpa-pipeline"
          ~ "managedBy"           = "Evidence Management" -> "Professional Applications"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat"
        name                            = "rpa-aat"
      ~ tags                            = {
          - "Destroy Me"          = "No" -> null
          - "Team Contact"        = "#em-dev-chat" -> null
          ~ "application"         = "evidence-management" -> "professional-applications"
          ~ "contactSlackChannel" = "#em-dev-chat" -> "#rpa-pipeline"
          ~ "managedBy"           = "Evidence Management" -> "Professional Applications"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat|rpa-aat"
        name                           = "rpa-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/rpa-aat-mi"
        name                = "rpa-aat-mi"
      ~ tags                = {
          - "Destroy Me"          = "No" -> null
          - "Team Contact"        = "#em-dev-chat" -> null
          ~ "application"         = "evidence-management" -> "professional-applications"
          ~ "contactSlackChannel" = "#em-dev-chat" -> "#rpa-pipeline"
          ~ "managedBy"           = "Evidence Management" -> "Professional Applications"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":138,"Program":"tfcmt","SHA1":"","Vars":{}} -->